[
    {
        "title": "League of Legends Ban Rates of Champions Analysis",
        "year": "2024",
        "image": "https://derricknguyen12.github.io/portfolio/images/league.jpg",
        "description": "An in-depth analysis of over 80,000 game statistics was conducted to determine whether banned champions tend to have higher win rates. This involved cleaning the dataset, performing univariate analysis on champion win rates and ban counts, and conducting bivariate analysis on pick rates, ban rates, and win rates to identify key patterns and trends. NMAR patterns were detected, and missingness in ban columns was tested, improving data reliability by 25%, which enhanced feature selection for downstream modeling. Additionally, a Random Forest Classifier was developed to predict a player’s league tier based on game statistics, achieving an accuracy of 93%."
    },
    {
        "title": "Steam Game Recommendation System",
        "year": "2025",
        "image": "https://www.pcworld.com/wp-content/uploads/2024/09/Steam-logo-on-top-of-a-background-full-of-Steam-library-games-1.jpg?quality=50&strip=all",
        "description": "A personalized game recommendation system was built using over 12,000 user-generated Steam reviews and detailed game metadata to match players with titles aligned to their tastes. Exploratory analysis revealed key trends in game popularity, review behavior, and user preferences. Feature engineering included one-hot encoding game tags, calculating sentiment scores from reviews, and normalizing playtime metrics. A Bayesian Network was constructed to model probabilistic relationships between user preferences, game features, and likelihood of recommendation. This approach enabled interpretable, data-driven recommendations that adapt to individual player behavior."
    },
    {
        "title": "Ethereum Price Predictions",
        "year": "2024",
        "image": "https://media-bitfinanzas-com.s3.amazonaws.com/wp-content/uploads/2024/11/converted_image_1220x686-6-1.jpeg",
        "description": "An in-depth analysis was conducted on a stock market dataset containing over 1 million data points to predict closing prices using various regression models. The data was preprocessed by log-transforming the volume column and applying min-max scaling to all features. Exploratory data analysis was performed to identify key trends, and polynomial regression was evaluated by generating a fitting graph to determine the optimal degree. The best-performing model was selected for further refinement, and feature selection techniques were applied to improve prediction accuracy. Model parameters were optimized, yielding valuable insights into stock price movements."
    },
    {
        "title": "Loan Approval Analysis for Young and Mid-Career Adults",
        "year": "2024",
        "image": "https://lendingplate.com/blog/wp-content/uploads/2023/08/Instant-Loan-Approval.png",
        "description": "This project examines how employment length, income, loan amount, and education level affect loan approval rates for young adults (18-28) compared to mid-career adults (28-38). The analysis found that mid-career adults have higher loan approval and repayment rates due to greater financial stability. Education level did not significantly impact loan approval for young adults, highlighting the importance of income and employment history. Key predictors of loan approval include income, job stability, and loan purpose. The project suggests young adults focus on stable income and employment to improve loan approval chances."
    },
    {
        "title": "Christmas Songs Manager",
        "year": "2022",
        "image": "https://derricknguyen12.github.io/portfolio/images/holiday.jpg",
        "description": "A full-featured song management application was designed and implemented using object-oriented principles and custom data structures to optimize song upload, search, and modification functionalities. A Binary Search Tree (BST) was developed to store and retrieve song data based on artist and song name with O(log n) time complexity, while a Hash Table was integrated for fast keyword-based song lyric searches in O(1) time. Additionally, the application supported the import and export of song data through file handling, incorporating robust input validation and exception handling to enhance user experience and application stability."
    },
    {
        "title": "CGMacros: Glucose Monitor",
        "year": "2025",
        "image": "https://t4.ftcdn.net/jpg/05/93/20/11/360_F_593201129_RNXrSPXSWEavl8dLLc54p8OlaHIwFR6a.jpg",
        "description": "An interactive explorable explanation was developed to visualize how different meal types and gut health levels influence glucose levels throughout the day. The project focused on modeling the impact of low, medium, and high carbohydrate meals on glucose response during breakfast, lunch, and dinner, while factoring in gut health quality—categorized as good, average, or bad. Using a combination of D3.js and Scrollama.js, the team created a scrollytelling website that guides users through dynamic, meal-specific glucose trends. The final visualization enables users to explore personalized nutrition insights through a smooth and interactive web interface."
    },
    {
        "title": "Interactive Bike Traffic Visualization in Boston Area",
        "year": "2025",
        "image": "../images/bostontraffic.png",
        "description": "This project visualizes bike traffic in the Boston area using an interactive map and a time-based filtering slider, allowing users to explore bike arrivals and departures at stations throughout the day. Built with JavaScript, D3.js, and Mapbox GL JS, the application efficiently processes over a quarter of a million trips, leveraging performance optimizations such as pre-bucketing trips by minute for smooth interactions. Users can adjust a time slider (ranging from -1 to 1440) to filter bike trips within a 60-minute window, dynamically updating the map and station markers. The interactive map allows users to hover over or click on stations for detailed trip information, providing an engaging and responsive way to analyze urban bike traffic trends."
    },
    {
        "title": "Classifying Schizophrenia",
        "year": "2025",
        "image": "https://1997bb66.delivery.rocketcdn.me/wp-content/uploads/2022/12/can-you-go-to-rehab-for-schizophrenia-light.jpg",
        "description": "This project explores the use of EEG signal analysis to classify individuals with schizophrenia by detecting disruptions in corollary discharge, a neural mechanism often impaired in affected patients. Using a dataset of EEG recordings from 81 subjects—both patients and healthy controls—we preprocessed the data through filtering, baseline correction, artifact removal, and Independent Component Analysis (ICA). Key ERP features were extracted from 9 critical electrode sites, and feature selection was guided by ANOVA and spatial voltage difference metrics. A Linear SVM classifier was then trained to distinguish between the two groups, achieving an accuracy of 88%. This work demonstrates the data-driven diagnosis of schizophrenia and deepen the understanding of its cognitive impacts."
    }
]