[
    {
        "title": "League of Legends Ban Rates of Champions Analysis",
        "year": "2024",
        "image": "https://derricknguyen12.github.io/portfolio/images/league.jpg",
        "description": "An in-depth analysis of over 80,000 game statistics was conducted to determine whether banned champions tend to have higher win rates. This involved cleaning the dataset, performing univariate analysis on champion win rates and ban counts, and conducting bivariate analysis on pick rates, ban rates, and win rates to identify key patterns and trends. NMAR patterns were detected, and missingness in ban columns was tested, improving data reliability by 25%, which enhanced feature selection for downstream modeling. Additionally, a Random Forest Classifier was developed to predict a player’s league tier based on game statistics, achieving an accuracy of 93%."
    },
    {
        "title": "Christmas Songs Manager",
        "year": "2022",
        "image": "https://derricknguyen12.github.io/portfolio/images/holiday.jpg",
        "description": "A full-featured song management application was designed and implemented using object-oriented principles and custom data structures to optimize song upload, search, and modification functionalities. A Binary Search Tree (BST) was developed to store and retrieve song data based on artist and song name with O(log n) time complexity, while a Hash Table was integrated for fast keyword-based song lyric searches in O(1) time. Additionally, the application supported the import and export of song data through file handling, incorporating robust input validation and exception handling to enhance user experience and application stability."
    },
    {
        "title": "Ethereum Price Predictions",
        "year": "2024",
        "image": "https://media-bitfinanzas-com.s3.amazonaws.com/wp-content/uploads/2024/11/converted_image_1220x686-6-1.jpeg",
        "description": "An in-depth analysis was conducted on a stock market dataset containing over 1 million data points to predict closing prices using various regression models. The data was preprocessed by log-transforming the volume column and applying min-max scaling to all features. Exploratory data analysis was performed to identify key trends, and polynomial regression was evaluated by generating a fitting graph to determine the optimal degree. The best-performing model was selected for further refinement, and feature selection techniques were applied to improve prediction accuracy. Model parameters were optimized, yielding valuable insights into stock price movements."
    },
    {
        "title": "Loan Approval Analysis for Young and Mid-Career Adults",
        "year": "2024",
        "image": "https://blog.stashfin.com/wp-content/uploads/2021/06/5-Things-You-Must-Know-Before-Applying-for-a-Personal-Loan-scaled.jpg",
        "description": "This project examines how employment length, income, loan amount, and education level affect loan approval rates for young adults (18-28) compared to mid-career adults (28-38). The analysis found that mid-career adults have higher loan approval and repayment rates due to greater financial stability. Education level did not significantly impact loan approval for young adults, highlighting the importance of income and employment history. Key predictors of loan approval include income, job stability, and loan purpose. The project suggests young adults focus on stable income and employment to improve loan approval chances."
    },
    {
        "title": "Fantasy Football Player Recommendation System",
        "year": "2024",
        "image": "https://media.licdn.com/dms/image/v2/C5612AQFrkD5YyeikBA/article-cover_image-shrink_600_2000/article-cover_image-shrink_600_2000/0/1566963637949?e=2147483647&v=beta&t=tF_4lKypiW8qWXd2pWgh0UFjLt0klXL3s06vezk1q6s",
        "description": "This project aims to build a recommendation system to help fantasy football managers decide which players to start each week. The system analyzes player performance, matchups, and positional considerations to generate weekly recommendations. Key features include evaluating player statistics such as points scored, injury status, opponent strength, and historical performance against specific teams. The system incorporates machine learning algorithms to predict optimal starting choices and utilizes data visualizations to highlight trends and insights. The goal is to assist users in making data-driven decisions to maximize their fantasy football team's performance each week."
    },
    {
        "title": "E-Commerce Product Recommendation Database",
        "year": "2024",
        "image": "https://www.edesk.com/wp-content/uploads/2021/03/find-trending-products-sell-ecommerce.png",
        "description": "This project involves building a structured database to store product details, user activities, and product categories. It includes creating a product database with attributes like name, price, and stock, along with a user database that tracks user profiles and interaction logs. Advanced SQL techniques such as joins, subqueries, and window functions are applied to generate personalized product recommendations, identify trending items, and analyze user behavior. The project aims to enhance the shopping experience by suggesting products that align with user preferences and behaviors, while also providing valuable insights into sales trends and popular products."
    },
    {
        "title": "AI-Powered Chatbot for Career Advice",
        "year": "2023",
        "image": "https://techbullion.com/wp-content/uploads/2024/10/Ai-powered-Chatbot-2-scaled-1-1000x600.jpg",
        "description": "An AI-powered chatbot was developed to provide personalized career recommendations based on user skills, interests, and industry trends. The system leveraged Natural Language Processing (NLP) to analyze user inputs and match them with relevant career paths. A knowledge base of job roles, required skills, and market demand was integrated, allowing the chatbot to offer data-driven insights. Machine learning techniques were applied to refine recommendations based on user feedback. The chatbot was deployed with an interactive interface, enabling dynamic conversations and real-time career guidance. This project highlights the potential of AI in career counseling and professional development."
    },
    {
        "title": "Personal Finance Manager App",
        "year": "2022",
        "image": "https://thumbs.dreamstime.com/b/personal-finance-flat-design-icons-vector-illustration-various-money-48658776.jpg",
        "description": "A cross-platform personal finance tracker was developed to help users manage expenses, track spending habits, and optimize budgets. The application categorizes transactions using natural language processing (NLP) and machine learning, providing personalized insights into spending patterns. Interactive dashboards visualize income, expenses, and savings trends, while predictive analytics suggest budget optimizations based on historical data. Secure authentication and encryption ensure data privacy, and cloud synchronization allows access across multiple devices. This tool empowers users to make informed financial decisions and improve their financial health."
    },
    {
        "title": "Music Genre Classifier",
        "year": "2023",
        "image": "https://static.vecteezy.com/system/resources/thumbnails/043/193/741/small_2x/music-notes-with-dark-neon-light-effect-3d-rendering-video.jpg",
        "description": "A machine learning model was developed to classify songs into genres based on key audio features such as tempo, pitch, and spectral content. The project involved preprocessing raw audio data, extracting relevant features using libraries like Librosa, and performing exploratory data analysis to understand genre-specific characteristics. Various classification models, including Random Forest, Support Vector Machines, and Neural Networks, were trained and evaluated for accuracy. Feature selection and hyperparameter tuning were conducted to optimize performance, with the best model achieving high classification accuracy. The project demonstrates the potential of audio analysis in music classification and recommendation systems."
    },
    {
        "title": "Secure File Storage System",
        "year": "2022",
        "image": "https://media.licdn.com/dms/image/v2/C5112AQGGcdUB8gcszg/article-cover_image-shrink_600_2000/article-cover_image-shrink_600_2000/0/1541052132937?e=2147483647&v=beta&t=DdY-42Yp9jQIxGVDAoS9mZgGUDjHsmgRBI3NFHecZ1c",
        "description": "Designed a cloud-based encrypted file storage system that allows users to securely upload, store, and retrieve files. Implemented end-to-end encryption to protect data privacy, ensuring only authorized users can access stored files. Developed a user authentication system with role-based access control to prevent unauthorized access. Integrated secure file-sharing functionality with temporary access links and expiration settings. Optimized storage efficiency with compression techniques and implemented logging mechanisms to track file activity for security auditing."
    },
    {
        "title": "Custom URL Shortener",
        "year": "2021",
        "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcR8MOIVFy6_UjpvYnQlbmtFjuIYJJ2KDQetlQ&s",
        "description": "Developed a custom URL shortener service that converts long URLs into concise, shareable links while tracking user engagement. The system includes analytics features to monitor click counts, geographic location, and referral sources. Integrated QR code generation for seamless mobile access. Designed with a scalable backend using a database to store URL mappings efficiently, ensuring fast redirections and preventing duplicate entries. Implemented security measures such as rate limiting and expiration settings to enhance usability and prevent abuse."
    },
    {
        "title": "Fitness Tracking System",
        "year": "2023",
        "image": "https://media.hackerearth.com/blog/wp-content/uploads/2016/08/Image-1.1.png",
        "description": "This project involves designing a database to store detailed user information, including workout logs, progress metrics, and nutrition plans. The database allows users to track their fitness journey by recording data such as exercise types, sets, reps, calories burned, and dietary intake. SQL queries are used to analyze workout trends, track calorie consumption, and evaluate the effectiveness of different exercises. Also incorporates indexing and partitioning techniques to handle large datasets efficiently, ensuring quick access to user-specific data and overall system performance. The system aims to provide users with insights into their fitness routines, helping them optimize workouts and nutrition plans for better results."
    }
]